Witali/yoRadio/esp8266/rtos-sdk-native/main/native_audio_output.c
static void IRAM_ATTR spi_pdm_complete(void) {
    spi_pdm_start_next_locked();
    if (s_spi_waiting) spi_pdm_wake_waiter();
}

#if YORADIO_ESP8266_SPI_PDM_FAST_ISR
static void IRAM_ATTR spi_pdm_isr(void *arg) {
    (void)arg;
    uint32_t status = READ_PERI_REG(DPORT_SPI_INT_STATUS_REG);
    if (!(status & DPORT_SPI_INT_STATUS_SPI1)) {
        /* The vector is shared. Preserve the SDK driver's SPI0 acknowledgement
         * in the exceptional case that its transfer-done interrupt is enabled. */
        if (status & DPORT_SPI_INT_STATUS_SPI0) SPI0.slave.val &= ~0x1fU;
        return;
    }
    /* The SDK repeats this write because early silicon can leave a transfer
     * flag asserted for one APB cycle. This loop normally runs once. */
    do {
        SPI1.slave.val &= ~0x1fU;
    } while (SPI1.slave.val & 0x1fU);
    spi_pdm_complete();
}
#else
static void IRAM_ATTR spi_pdm_event(int event, void *arg) {
    (void)arg;
    if (event == SPI_TRANS_DONE_EVENT) spi_pdm_complete();
}
#endif

static uint32_t spi_pdm_wait_notification(void) {
#if YORADIO_ESP8266_AUDIO_PROFILE
    audio_profile_spi_wait_begin();
#elif YORADIO_ESP8266_AUDIO_OUTPUT_BENCHMARK
    audio_output_benchmark_spi_wait_begin();
#endif
    uint32_t notified = ulTaskNotifyTake(pdTRUE,
                                         pdMS_TO_TICKS(SPI_PDM_WAIT_MS));
#if YORADIO_ESP8266_AUDIO_PROFILE
    audio_profile_spi_wait_end();
#elif YORADIO_ESP8266_AUDIO_OUTPUT_BENCHMARK
    audio_output_benchmark_spi_wait_end();
#endif
    return notified;
}

static esp_err_t spi_pdm_select_pin(void) {
    if (s_spi_pin_selected) return ESP_OK;
    spi_interface_t interface = s_spi_interface;
    esp_err_t result = spi_set_interface(HSPI_HOST, &interface);
    if (result == ESP_OK) s_spi_pin_selected = true;
    return result;
}

static esp_err_t spi_pdm_acquire(spi_pdm_chunk_t **out) {
    if (!out) return ESP_ERR_INVALID_ARG;
    esp_err_t result = spi_pdm_select_pin();
    if (result != ESP_OK) return result;
    for (;;) {
        taskENTER_CRITICAL();
        if (s_spi_queue_count < SPI_PDM_QUEUE_CHUNKS) {
            s_spi_waiting = false;
            spi_pdm_chunk_t *chunk = &s_spi_queue[s_spi_queue_tail];
            taskEXIT_CRITICAL();
            memset(chunk->words, 0, sizeof(chunk->words));
            chunk->bit_count = 0;
            *out = chunk;
            return ESP_OK;
        }
        s_spi_waiter = xTaskGetCurrentTaskHandle();
        s_spi_waiting = true;
        taskEXIT_CRITICAL();
        if (!spi_pdm_wait_notification()) {
            taskENTER_CRITICAL();
            s_spi_waiting = false;
            taskEXIT_CRITICAL();
            return ESP_ERR_TIMEOUT;
        }
    }
}

static esp_err_t spi_pdm_commit(spi_pdm_chunk_t *chunk, size_t bit_count) {
    if (!chunk || !bit_count || bit_count > SPI_PDM_CHUNK_BITS)
        return ESP_ERR_INVALID_ARG;
    taskENTER_CRITICAL();
    if (chunk != &s_spi_queue[s_spi_queue_tail] ||
        s_spi_queue_count >= SPI_PDM_QUEUE_CHUNKS) {
        taskEXIT_CRITICAL();
        return ESP_ERR_INVALID_STATE;
    }
    chunk->bit_count = (uint16_t)bit_count;
#if SPI_PDM_GAP_STATS
    chunk->wire_cycles = (uint32_t)(
        ((uint64_t)CONFIG_ESP8266_DEFAULT_CPU_FREQ_MHZ * 1000000ULL *
         bit_count + BOARD_SPI_PDM_BIT_RATE_HZ / 2U) /
        BOARD_SPI_PDM_BIT_RATE_HZ);
#endif
    ++s_spi_queue_tail;
    if (s_spi_queue_tail == SPI_PDM_QUEUE_CHUNKS) s_spi_queue_tail = 0;
    ++s_spi_queue_count;
    if (!s_spi_active) spi_pdm_start_next_locked();
    taskEXIT_CRITICAL();
    return ESP_OK;
}

static esp_err_t spi_pdm_wait_idle(void) {
    for (;;) {
        taskENTER_CRITICAL();
        bool idle = !s_spi_active && !s_spi_queue_count;
        if (idle) {
            s_spi_waiting = false;
        } else {
            s_spi_waiter = xTaskGetCurrentTaskHandle();
            s_spi_waiting = true;
        }
        taskEXIT_CRITICAL();
        if (idle) return ESP_OK;
        if (!spi_pdm_wait_notification()) {
            taskENTER_CRITICAL();
            s_spi_waiting = false;
            taskEXIT_CRITICAL();
            return ESP_ERR_TIMEOUT;
        }
    }
}

static esp_err_t spi_pdm_emit_sample(int16_t sample, spi_pdm_chunk_t **chunk,
                                     size_t *bit_count) {
    if (!*chunk) {
        esp_err_t result = spi_pdm_acquire(chunk);
        if (result != ESP_OK) return result;
    }
    const uint32_t target = (uint32_t)((int32_t)sample - INT16_MIN);
    for (unsigned bit = 0; bit < BOARD_SPI_PDM_OVERSAMPLE; ++bit) {
        s_pdm_integrator += target;
        bool high = s_pdm_integrator >= 65536U;
        if (high) s_pdm_integrator -= 65536U;
        if (high) {
            size_t word = *bit_count / 32U;
            unsigned shift = 31U - (unsigned)(*bit_count % 32U);
            (*chunk)->words[word] |= 1UL << shift;
        }
        ++*bit_count;
        if (*bit_count == SPI_PDM_CHUNK_BITS) {
            esp_err_t result = spi_pdm_commit(*chunk, *bit_count);
            if (result != ESP_OK) return result;
            *chunk = NULL;
            *bit_count = 0;
        }
    }
    return ESP_OK;
}

esp_err_t native_audio_output_init(void) {
    spi_config_t config = {
        .interface = s_spi_interface,
        .intr_enable = {.trans_done = 1},
#if YORADIO_ESP8266_SPI_PDM_FAST_ISR
        .event_cb = NULL,
#else
        .event_cb = spi_pdm_event,
#endif
        .mode = SPI_MASTER_MODE,
        /* Initialize through the public API, then use the full hardware
         * pre-divider because the public enum stops at 2 MHz. */
        .clk_div = SPI_2MHz_DIV,
    };
    esp_err_t result = spi_init(HSPI_HOST, &config);
    if (result == ESP_OK) {
        /* APB is fixed at 80 MHz. The selected integral divider produces
         * 48.077 kHz times either 8 or 16 PDM bits/sample (+0.16%). */
        SPI1.clock.clk_equ_sysclk = false;
        SPI1.clock.clkdiv_pre = BOARD_SPI_PDM_CLOCK_PREDIV;
        SPI1.clock.clkcnt_n = 7;
        SPI1.clock.clkcnt_h = 3;
        SPI1.clock.clkcnt_l = 7;
        s_spi_queue_head = 0;
        s_spi_queue_tail = 0;
        s_spi_queue_count = 0;
        s_spi_active = false;
        s_spi_waiter = NULL;
        s_spi_waiting = false;
#if SPI_PDM_GAP_STATS
        s_spi_last_start_cycle = 0;
#endif
        native_audio_output_reset_spi_stats();
#if YORADIO_ESP8266_SPI_PDM_FAST_ISR
        _xt_isr_mask(1U << ETS_SPI_INUM);
        _xt_isr_attach(ETS_SPI_INUM, spi_pdm_isr, NULL);
        _xt_isr_unmask(1U << ETS_SPI_INUM);
#endif
        s_spi_initialized = true;
        s_spi_pin_selected = true;
    }
    native_audio_output_reload_settings();
    if (result == ESP_OK) {
        ESP_LOGI(TAG,
                 "SPI-PDM: mono GPIO%d/D7, %u Hz, %u bits/sample; "
                 "GPIO%d/D5 clock unused; fast_isr=%u",
                 BOARD_SPI_PDM_DATA_GPIO, BOARD_SPI_PDM_BIT_RATE_HZ,
                 BOARD_SPI_PDM_OVERSAMPLE,
                 BOARD_SPI_PDM_CLOCK_GPIO,
                 (unsigned)YORADIO_ESP8266_SPI_PDM_FAST_ISR);
    }
    return result;
}

esp_err_t native_audio_output_write(int16_t *samples, size_t sample_count,
                                    uint32_t sample_rate, uint8_t channels) {
    if (!samples || !sample_count || !sample_rate ||
        (channels != 1 && channels != 2) || sample_count % channels)
        return ESP_ERR_INVALID_ARG;
    if (!s_spi_initialized) return ESP_ERR_INVALID_STATE;
    size_t frames = sample_count / channels;
    native_audio_normalizer_configure(
        s_normalization_enabled, s_normalization_max_gain_db,
        s_normalization_target_db, s_normalization_time_ms, sample_rate);
    native_audio_normalizer_process(samples, frames, channels);
    uint8_t left_balance = s_balance < 0
        ? (uint8_t)(BALANCE_DENOMINATOR + s_balance) : BALANCE_DENOMINATOR;
    uint8_t right_balance = s_balance > 0
        ? (uint8_t)(BALANCE_DENOMINATOR - s_balance) : BALANCE_DENOMINATOR;
    uint32_t left_gain = channel_gain_q15(s_volume, left_balance);
    uint32_t right_gain = channel_gain_q15(s_volume, right_balance);
    for (size_t frame = 0; frame < frames; ++frame) {
        samples[frame * channels] =
            scale_sample(samples[frame * channels], left_gain);
        if (channels == 2) {
            samples[frame * 2U + 1U] =
                scale_sample(samples[frame * 2U + 1U], right_gain);
        }
    }
#if defined(YORADIO_ESP8266_AUDIO_TRACE)
    trace_output_pcm(samples, frames, channels);
#endif

