Witali/yoRadio/esp8266/rtos-sdk-native/main/native_audio_output.c
    if (sample_rate != s_input_sample_rate) {
        s_input_sample_rate = sample_rate;
        s_resample_phase = 0;
    }
    spi_pdm_chunk_t *chunk = NULL;
    size_t bit_count = 0;
    for (size_t frame = 0; frame < frames; ++frame) {
        int32_t mono = samples[frame * channels];
        if (channels == 2)
            mono = (mono + samples[frame * 2U + 1U]) / 2;
        s_resample_phase += BOARD_SPI_PDM_SAMPLE_RATE;
        while (s_resample_phase >= sample_rate) {
            esp_err_t result = spi_pdm_emit_sample(
                (int16_t)mono, &chunk, &bit_count);
            if (result != ESP_OK) return result;
            s_resample_phase -= sample_rate;
        }
    }
    return bit_count ? spi_pdm_commit(chunk, bit_count) : ESP_OK;
}

void native_audio_output_silence(void) {
    if (!s_spi_initialized) return;
    esp_err_t result = spi_pdm_wait_idle();
    spi_pdm_chunk_t *silence = NULL;
    if (result == ESP_OK) result = spi_pdm_acquire(&silence);
    if (result == ESP_OK) {
        for (size_t index = 0; index < SPI_PDM_CHUNK_WORDS; ++index)
            silence->words[index] = 0xaaaaaaaaU;
        result = spi_pdm_commit(silence, SPI_PDM_CHUNK_BITS);
    }
    if (result == ESP_OK) result = spi_pdm_wait_idle();
    if (result != ESP_OK)
        ESP_LOGE(TAG, "SPI-PDM drain failed: %s", esp_err_to_name(result));
    taskENTER_CRITICAL();
    s_spi_queue_head = 0;
    s_spi_queue_tail = 0;
    s_spi_queue_count = 0;
    s_spi_active = false;
    s_spi_waiting = false;
    taskEXIT_CRITICAL();
    gpio_set_direction(BOARD_SPI_PDM_DATA_GPIO, GPIO_MODE_OUTPUT);
    gpio_set_level(BOARD_SPI_PDM_DATA_GPIO, 0);
    s_spi_pin_selected = false;
    s_input_sample_rate = 0;
    s_resample_phase = 0;
    s_pdm_integrator = 0;
}
#elif YORADIO_ESP8266_I2S_PDM

#define I2S_PDM_BATCH_WORDS 64U
#define I2S_PDM_WRITE_TIMEOUT_MS 100U
#define I2S_PDM_SILENCE_WORD 0xaaaaaaaaU

typedef struct {
    uint32_t words[I2S_PDM_BATCH_WORDS];
    size_t word_count;
    TickType_t deadline;
} i2s_pdm_writer_t;

static esp_err_t i2s_pdm_write_words(i2s_pdm_writer_t *writer,
                                     const uint32_t *words,
                                     size_t word_count) {
    TickType_t now = xTaskGetTickCount();
    if ((int32_t)(writer->deadline - now) <= 0) return ESP_ERR_TIMEOUT;
    esp_err_t result = esp8266_nodac_i2s_write(
        words, word_count, writer->deadline - now);
    if (result != ESP_OK)
        ESP_LOGE(TAG, "I2S-PDM DMA write failed: %s",
                 esp_err_to_name(result));
    return result;
}

static esp_err_t i2s_pdm_flush(i2s_pdm_writer_t *writer) {
    if (!writer->word_count) return ESP_OK;
    esp_err_t result =
        i2s_pdm_write_words(writer, writer->words, writer->word_count);
    if (result == ESP_OK) writer->word_count = 0;
    return result;
}

#if CONFIG_YORADIO_I2S_PDM_OVERSAMPLE_32
#if BOARD_I2S_PDM_OVERSAMPLE != 32U || BOARD_I2S_PDM_REPEAT != 1U
#error "The optimized PDM32 packer requires 32 genuine bits per sample"
#endif

/* This packer runs in the audio task, not in the DMA ISR. Keep scarce IRAM
 * for decoder word workspaces; flash execution remains cache-backed. */
static uint32_t __attribute__((noinline))
i2s_pdm_pack32(int16_t sample) {
    const uint32_t target = (uint32_t)((int32_t)sample - INT16_MIN);
    uint32_t integrator = s_pdm_integrator;
    uint32_t word = 0;
#define PDM32_STEP() do { \
        uint32_t sum = integrator + target; \
        integrator = sum & 0xffffU; \
        word = (word << 1) | (sum >> 16); \
    } while (0)
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
    PDM32_STEP(); PDM32_STEP(); PDM32_STEP(); PDM32_STEP();
#undef PDM32_STEP
    s_pdm_integrator = integrator;
    return word;
}
#else
static esp_err_t i2s_pdm_push_bit(i2s_pdm_writer_t *writer, bool high) {
    s_i2s_pdm_partial_word =
        (s_i2s_pdm_partial_word << 1) | (high ? 1U : 0U);
    ++s_i2s_pdm_partial_bits;
    if (s_i2s_pdm_partial_bits != 32U) return ESP_OK;

    writer->words[writer->word_count++] = s_i2s_pdm_partial_word;
    s_i2s_pdm_partial_word = 0;
    s_i2s_pdm_partial_bits = 0;
    return writer->word_count == I2S_PDM_BATCH_WORDS
        ? i2s_pdm_flush(writer) : ESP_OK;
}
#endif

static esp_err_t i2s_pdm_emit_sample(int16_t sample,
                                     i2s_pdm_writer_t *writer) {
#if CONFIG_YORADIO_I2S_PDM_OVERSAMPLE_32
    writer->words[writer->word_count++] = i2s_pdm_pack32(sample);
    return writer->word_count == I2S_PDM_BATCH_WORDS
        ? i2s_pdm_flush(writer) : ESP_OK;
#else
    const uint32_t target = (uint32_t)((int32_t)sample - INT16_MIN);
    for (unsigned bit = 0; bit < BOARD_I2S_PDM_OVERSAMPLE; ++bit) {
        s_pdm_integrator += target;
        bool high = s_pdm_integrator >= 65536U;
        if (high) s_pdm_integrator -= 65536U;
        for (unsigned repeat = 0; repeat < BOARD_I2S_PDM_REPEAT; ++repeat) {
            esp_err_t result = i2s_pdm_push_bit(writer, high);
            if (result != ESP_OK) return result;
        }
    }
    return ESP_OK;
#endif
}

static esp_err_t i2s_pdm_finish_partial_word(i2s_pdm_writer_t *writer) {
#if !CONFIG_YORADIO_I2S_PDM_OVERSAMPLE_32
    while (s_i2s_pdm_partial_bits) {
        esp_err_t result = i2s_pdm_emit_sample(0, writer);
        if (result != ESP_OK) return result;
    }
#endif
    return i2s_pdm_flush(writer);
}

static esp_err_t i2s_pdm_fill_dma_silence(void) {
    esp8266_nodac_i2s_silence(I2S_PDM_SILENCE_WORD);
    return ESP_OK;
}

esp_err_t native_audio_output_init(void) {
    esp_err_t result = esp8266_nodac_i2s_init(
        I2S_PDM_SILENCE_WORD, BOARD_I2S_PDM_BCK_DIV,
        BOARD_I2S_PDM_CLKM_DIV);
    if (result == ESP_OK) {
        s_i2s_started = true;
        s_input_sample_rate = 0;
        s_resample_phase = 0;
        s_pdm_integrator = 0;
        s_i2s_pdm_partial_word = 0;
        s_i2s_pdm_partial_bits = 0;
    }
    native_audio_output_reload_settings();
    if (result == ESP_OK) {
        ESP_LOGI(TAG,
                 "I2S-PDM DMA: mono GPIO%d/RX, carrier %u Hz, "
                 "PDM%u x%u effective %u Hz, nominal carrier %u Hz, "
                 "%u x %u words; UART RX ignored",
                 BOARD_I2S_DATA_GPIO, BOARD_I2S_PDM_CARRIER_HZ,
                 BOARD_I2S_PDM_OVERSAMPLE, BOARD_I2S_PDM_REPEAT,
                 BOARD_I2S_PDM_EFFECTIVE_HZ, BOARD_I2S_PDM_NOMINAL_HZ,
                 ESP8266_NODAC_DMA_BUFFER_COUNT,
                 ESP8266_NODAC_DMA_BUFFER_WORDS);
    }
    return result;
}

esp_err_t native_audio_output_write(int16_t *samples, size_t sample_count,
                                    uint32_t sample_rate, uint8_t channels) {
    if (!samples || !sample_count || !sample_rate ||
        (channels != 1 && channels != 2) || sample_count % channels)
        return ESP_ERR_INVALID_ARG;
    if (!s_i2s_started) return ESP_ERR_INVALID_STATE;

    size_t frames = sample_count / channels;
    native_audio_normalizer_configure(
        s_normalization_enabled, s_normalization_max_gain_db,
        s_normalization_target_db, s_normalization_time_ms, sample_rate);
    native_audio_normalizer_process(samples, frames, channels);
    uint8_t left_balance = s_balance < 0
        ? (uint8_t)(BALANCE_DENOMINATOR + s_balance) : BALANCE_DENOMINATOR;
    uint8_t right_balance = s_balance > 0
        ? (uint8_t)(BALANCE_DENOMINATOR - s_balance) : BALANCE_DENOMINATOR;
    uint32_t left_gain = channel_gain_q15(s_volume, left_balance);
    uint32_t right_gain = channel_gain_q15(s_volume, right_balance);
    for (size_t frame = 0; frame < frames; ++frame) {
        samples[frame * channels] =
            scale_sample(samples[frame * channels], left_gain);
        if (channels == 2) {
            samples[frame * 2U + 1U] =
                scale_sample(samples[frame * 2U + 1U], right_gain);
        }
    }
#if defined(YORADIO_ESP8266_AUDIO_TRACE)
    trace_output_pcm(samples, frames, channels);
#endif

