Witali/yoRadio/esp8266/rtos-sdk-native/main/native_audio_output.c
    if (sample_rate != s_input_sample_rate) {
        s_input_sample_rate = sample_rate;
        s_resample_phase = 0;
    }
    i2s_pdm_writer_t writer = {
        .deadline = xTaskGetTickCount() +
                    pdMS_TO_TICKS(I2S_PDM_WRITE_TIMEOUT_MS),
    };
    for (size_t frame = 0; frame < frames; ++frame) {
        int32_t mono = samples[frame * channels];
        if (channels == 2)
            mono = (mono + samples[frame * 2U + 1U]) / 2;
        s_resample_phase += BOARD_I2S_PDM_SAMPLE_RATE;
        while (s_resample_phase >= sample_rate) {
            esp_err_t result =
                i2s_pdm_emit_sample((int16_t)mono, &writer);
            if (result != ESP_OK) return result;
            s_resample_phase -= sample_rate;
        }
    }
    return i2s_pdm_flush(&writer);
}

void native_audio_output_silence(void) {
    if (!s_i2s_started) return;
    i2s_pdm_writer_t writer = {
        .deadline = xTaskGetTickCount() +
                    pdMS_TO_TICKS(I2S_PDM_WRITE_TIMEOUT_MS),
    };
    esp_err_t result = i2s_pdm_finish_partial_word(&writer);
    if (result == ESP_OK) result = i2s_pdm_fill_dma_silence();
    if (result != ESP_OK)
        ESP_LOGE(TAG, "I2S-PDM silence failed: %s", esp_err_to_name(result));
    s_input_sample_rate = 0;
    s_resample_phase = 0;
    s_pdm_integrator = 0;
    s_i2s_pdm_partial_word = 0;
    s_i2s_pdm_partial_bits = 0;
}

#else

esp_err_t native_audio_output_init(void) {
    const i2s_config_t config = {
        .mode = I2S_MODE_MASTER | I2S_MODE_TX,
        .sample_rate = 44100,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
        .communication_format = I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_MSB,
        .dma_buf_count = 4,
        .dma_buf_len = 128,
        .tx_desc_auto_clear = true,
    };
    const i2s_pin_config_t pins = {
        .bck_o_en = 1,
        .ws_o_en = 1,
        .data_out_en = 1,
        .data_in_en = 0,
    };
    i2s_enable_bbpll_audio_clock();
    esp_err_t result = i2s_driver_install(I2S_NUM_0, &config, 0, NULL);
    if (result == ESP_OK) result = i2s_set_pin(I2S_NUM_0, &pins);
    if (result == ESP_OK)
        result = i2s_set_clk(I2S_NUM_0, 44100,
                             I2S_BITS_PER_SAMPLE_16BIT,
                             I2S_CHANNEL_STEREO);
    if (result == ESP_OK) {
        /* Keep SLC DMA active between streams. The legacy ESP8266 driver
         * reports a stopped-DMA write timeout as ESP_OK with zero bytes, so
         * silence is written into the existing descriptors instead. */
        s_sample_rate = 44100;
        s_i2s_started = true;
        s_clock_primed = false;
        result = i2s_zero_dma_buffer(I2S_NUM_0);
    }
    native_audio_output_reload_settings();
    ESP_LOGI(TAG, "I2S DMA: 4 x 128 stereo frames");
    return result;
}

esp_err_t native_audio_output_write(int16_t *samples, size_t sample_count,
                                    uint32_t sample_rate, uint8_t channels) {
    if (!samples || !sample_count || !sample_rate ||
        (channels != 1 && channels != 2)) return ESP_ERR_INVALID_ARG;
    size_t frames = sample_count / channels;
    native_audio_normalizer_configure(
        s_normalization_enabled, s_normalization_max_gain_db,
        s_normalization_target_db, s_normalization_time_ms, sample_rate);
    native_audio_normalizer_process(samples, frames, channels);
    uint8_t left_balance = s_balance < 0
        ? (uint8_t)(BALANCE_DENOMINATOR + s_balance) : BALANCE_DENOMINATOR;
    uint8_t right_balance = s_balance > 0
        ? (uint8_t)(BALANCE_DENOMINATOR - s_balance) : BALANCE_DENOMINATOR;
    uint32_t left_gain = channel_gain_q15(s_volume, left_balance);
    uint32_t right_gain = channel_gain_q15(s_volume, right_balance);
    for (size_t frame = 0; frame < frames; ++frame) {
        samples[frame * channels] =
            scale_sample(samples[frame * channels], left_gain);
        if (channels == 2) {
            samples[frame * 2U + 1U] =
                scale_sample(samples[frame * 2U + 1U], right_gain);
        }
    }
    if (channels == 1) {
        if (sample_count > 1152) return ESP_ERR_INVALID_SIZE;
        for (size_t index = sample_count; index-- > 0;) {
            int16_t value = samples[index];
            samples[index * 2] = value;
            samples[index * 2 + 1] = value;
        }
        sample_count *= 2;
    }
    if (!s_clock_primed || sample_rate != s_sample_rate) {
        esp_err_t result = i2s_set_clk(I2S_NUM_0, sample_rate,
                                       I2S_BITS_PER_SAMPLE_16BIT,
                                       I2S_CHANNEL_STEREO);
        if (result != ESP_OK) return result;
        s_sample_rate = sample_rate;
        s_clock_primed = true;
    }
    size_t bytes = sample_count * sizeof(*samples);
    if (!s_i2s_started) {
        esp_err_t result = i2s_start(I2S_NUM_0);
        if (result != ESP_OK) return result;
        s_i2s_started = true;
    }

    size_t offset = 0;
    while (offset < bytes) {
        size_t bytes_written = 0;
        esp_err_t result = i2s_write(
            I2S_NUM_0, (uint8_t *)samples + offset, bytes - offset,
            &bytes_written, pdMS_TO_TICKS(1000));
        if (result != ESP_OK || !bytes_written) {
            ESP_LOGE(TAG, "I2S write failed: %s, %u/%u bytes",
                     esp_err_to_name(result), (unsigned)offset,
                     (unsigned)bytes);
            return result == ESP_OK ? ESP_FAIL : result;
        }
        offset += bytes_written;
    }
    return ESP_OK;
}

void native_audio_output_silence(void) {
    if (!s_i2s_started) return;
    esp_err_t result = i2s_zero_dma_buffer(I2S_NUM_0);
    if (result != ESP_OK)
        ESP_LOGE(TAG, "I2S silence failed: %s", esp_err_to_name(result));
    s_clock_primed = false;
}

#endif

void native_audio_output_reset_spi_stats(void) {
#if YORADIO_ESP8266_SPI_PDM && SPI_PDM_GAP_STATS
    taskENTER_CRITICAL();
    s_spi_gap_cycles_total = 0;
    s_spi_gap_cycles_max = 0;
    s_spi_chained_transfers = 0;
    s_spi_queue_empty_events = 0;
    taskEXIT_CRITICAL();
#elif YORADIO_ESP8266_I2S_PDM
    esp8266_nodac_i2s_reset_underruns();
#endif
}

