Witali/yoRadio/esp8266/rtos-sdk-native/main/native_audio_output.c
void native_audio_output_get_spi_stats(native_audio_output_spi_stats_t *stats) {
    if (!stats) return;
    memset(stats, 0, sizeof(*stats));
#if YORADIO_ESP8266_SPI_PDM && SPI_PDM_GAP_STATS
    taskENTER_CRITICAL();
    stats->chained_transfers = s_spi_chained_transfers;
    stats->gap_cycles_total = s_spi_gap_cycles_total;
    stats->gap_cycles_max = s_spi_gap_cycles_max;
    stats->queue_empty_events = s_spi_queue_empty_events;
    taskEXIT_CRITICAL();
#elif YORADIO_ESP8266_I2S_PDM
    stats->queue_empty_events = esp8266_nodac_i2s_underruns();
#endif
}

void native_audio_output_reload_settings(void) {
    persistent_settings_t settings;
    persistent_settings_get(&settings);
    s_volume = settings.volume > VOLUME_DENOMINATOR
                   ? VOLUME_DENOMINATOR : settings.volume;
    s_balance = settings.balance < -BALANCE_DENOMINATOR
                    ? -BALANCE_DENOMINATOR
                    : (settings.balance > BALANCE_DENOMINATOR
                           ? BALANCE_DENOMINATOR : settings.balance);
    s_normalization_enabled = settings.normalization_enabled;
    s_normalization_max_gain_db = settings.normalization_max_gain_db;
    s_normalization_target_db = settings.normalization_target_db;
    s_normalization_time_ms = settings.normalization_time_ms;
}

void native_audio_output_reset_normalizer(void) {
    native_audio_normalizer_reset();
}

uint8_t native_audio_output_volume(void) { return s_volume; }

void native_audio_output_set_volume_runtime(uint8_t volume) {
    s_volume = volume > VOLUME_DENOMINATOR ? VOLUME_DENOMINATOR : volume;
}

void native_audio_output_set_balance_runtime(int8_t balance) {
    s_balance = balance < -BALANCE_DENOMINATOR
                    ? -BALANCE_DENOMINATOR
                    : (balance > BALANCE_DENOMINATOR
                           ? BALANCE_DENOMINATOR : balance);
}
